[
  {
    "account_category_name": "Cash and Cash Equivalents",
    "description": "Cash on hand, demand deposits, and short-term highly liquid investments readily convertible to cash with original maturities of three months or less. Examples: Cash in hand, bank current accounts, money market funds, treasury bills ≤3 months."
  },
  {
    "account_category_name": "Cost of Goods Sold",
    "description": "Direct costs attributable to cost of goods sold. Examples: Raw materials, stock in trade."
  },
  {
    "account_category_name": "Current Tax Liabilities",
    "description": "Income tax obligations for current and prior periods. Examples: Provision for income tax, advance tax paid, tax deducted at source."
  },
  {
    "account_category_name": "Finance Costs",
    "description": "Interest and financing-related expenses. Examples: Interest on borrowings, bank charges, lease interest, foreign exchange losses."
  },
  {
    "account_category_name": "Intangible Assets",
    "description": "Identifiable non-monetary assets without physical substance. Examples: Software, patents, trademarks, licenses, development costs."
  },
  {
    "account_category_name": "Investment Income",
    "description": "Returns generated from financial investments and cash management. Examples: Interest income, dividend income, rental income, fair value gains."
  },
  {
    "account_category_name": "Long-term Borrowings",
    "description": "Interest-bearing debt obligations with maturity beyond one year. Examples: Term loans, bonds, debentures, mortgages."
  },
  {
    "account_category_name": "Long-term Investments",
    "description": "Investments held for strategic purposes or extended periods. Examples: Equity investments, bonds, associates, joint ventures, deposits."
  },
  {
    "account_category_name": "Long-term Provisions",
    "description": "Present obligations beyond one year with uncertain timing/amount. Examples: Asset retirement obligations, environmental remediation, legal settlements."
  },
  {
    "account_category_name": "Operating Expenses",
    "description": "Costs incurred in ordinary business operations excluding direct costs. Examples: Selling expenses, administrative costs, marketing, utilities, rent."
  },
  {
    "account_category_name": "Other Current Assets",
    "description": "Current assets not classified elsewhere including prepaid expenses and advances. Examples: Prepaid insurance, prepaid rent, advance to suppliers, security deposits recoverable within one year."
  },
  {
    "account_category_name": "Other Current Liabilities",
    "description": "Short-term obligations not classified elsewhere. Examples: Accrued expenses, statutory liabilities, employee payables."
  },
  {
    "account_category_name": "Other Direct Costs",
    "description": "Direct costs excluding cost of goods sold. Examples: Direct labor, manufacturing overhead, freight inward."
  },
  {
    "account_category_name": "Other Non-current Assets",
    "description": "Long-term assets not classified elsewhere. Examples: Security deposits, long-term prepayments, advances for capital goods."
  },
  {
    "account_category_name": "Other Non-current Liabilities",
    "description": "Long-term obligations not classified elsewhere. Examples: Long-term deposits, deferred income, government grants."
  },
  {
    "account_category_name": "Other Operating Income",
    "description": "Incidental income related to business operations but not core revenue. Examples: Scrap sales, government grants, insurance claims, foreign exchange gains."
  },
  {
    "account_category_name": "Other Payables",
    "description": "Non-trade payables and obligations to parties other than suppliers. Examples: Employee payables, accrued expenses, customer advances, security deposits received."
  },
  {
    "account_category_name": "Other Receivables",
    "description": "Non-trade amounts due to the entity excluding financing arrangements. Examples: Employee advances, insurance claims, tax refunds, deposits recoverable."
  },
  {
    "account_category_name": "Reserves and Surplus",
    "description": "Accumulated profits and other reserves created from profits or share premium. Examples: General reserves, retained earnings, statutory reserves, share premium."
  },
  {
    "account_category_name": "Revenue from Operations",
    "description": "Income from primary business activities in ordinary course. Examples: Sales of goods, service revenue, commission income, royalty income."
  },
  {
    "account_category_name": "Share Capital",
    "description": "Nominal value of issued and paid-up equity shares. Examples: Common stock, ordinary shares, preference shares."
  },
  {
    "account_category_name": "Short-term Borrowings",
    "description": "Interest-bearing debt obligations due within one year. Examples: Bank overdrafts, short-term loans, current portion of long-term debt."
  },
  {
    "account_category_name": "Short-term Investments",
    "description": "Financial instruments held for short-term investment purposes, readily convertible to cash. Examples: Marketable securities, fixed deposits >3 months, mutual funds."
  },
  {
    "account_category_name": "Short-term Provisions",
    "description": "Present obligations due within one year with uncertain timing or amount. Examples: Warranty provisions, legal claims, restructuring costs."
  },
  {
    "account_category_name": "Stock Assets",
    "description": "Inventory and stock-related assets including raw materials, work in progress, finished goods, and stock in trade. Examples: Raw materials, finished goods, trading merchandise, consumables."
  },
  {
    "account_category_name": "Tangible Assets",
    "description": "Physical assets used in business operations including property, plant, and equipment. Examples: Land, buildings, machinery, equipment, vehicles, furniture, capital work in progress."
  },
  {
    "account_category_name": "Tax Expense",
    "description": "Current and deferred income tax obligations. Examples: Current tax provision, deferred tax expense, withholding taxes."
  },
  {
    "account_category_name": "Trade Payables",
    "description": "Amounts owed to suppliers. Examples: Supplier invoices, accrued purchases, bills payable."
  },
  {
    "account_category_name": "Trade Receivables",
    "description": "Amounts due from customers for goods sold or services provided in ordinary course of business. Examples: Accounts receivable, notes receivable from customers, unbilled revenue."
  }
]